https://www.linkedin.com/in/chetna-l-47b733258/

Write a Python script to generate and print a dictionary that contains a number (between 1 and n) in the form (x, x*x). Sample Dictionary ( n = 5) : Expected Output : {1: 1, 2: 4, 3: 9, 4: 16, 5: 25}

In [ ]:
{x:x**2 for x in range(1,6)}#Dictionary comperhension

{1: 1, 2: 4, 3: 9, 4: 16, 5: 25}

Write a Python script to print a dictionary where the keys are numbers between 1 and 15 (both included) and the values are square of keys. Sample Dictionary {1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81, 10: 100, 11: 121, 12: 144, 13: 169, 14: 196, 15: 225}

In [ ]:
{x:x**2 for x in range(1,16)}#Dictionary comperhension

{1: 1,
 2: 4,
 3: 9,
 4: 16,
 5: 25,
 6: 36,
 7: 49,
 8: 64,
 9: 81,
 10: 100,
 11: 121,
 12: 144,
 13: 169,
 14: 196,
 15: 225}

Write a Python script to merge two Python dictionaries.

In [ ]:
d1={x:x*2 for x in range(1,5)}
d2={x:x*2 for x in range(5,9)}
d1.update(d2)
d1

{1: 2, 2: 4, 3: 6, 4: 8, 5: 10, 6: 12, 7: 14, 8: 16}

In [ ]:
d2

{5: 10, 6: 12, 7: 14, 8: 16}

Write a Python program to map two lists into a dictionary.

In [ ]:
l1=[1,2,3]
l2=[3,4,5]
z=zip(l1,l2)
d1=dict(z)
print(d1)

{1: 3, 2: 4, 3: 5}

In [ ]:
z

In [ ]:
l=[1,2,3,4]
z=zip(l,l)
print(list(z))

[(1, 1), (2, 2), (3, 3), (4, 4)]

In [ ]:
l=[1,2,3,4]
p=[5,6,7]
z=zip(l,p)
print(list(z))

[(1, 5), (2, 6), (3, 7)]

In [ ]:
l1=[1,2,3,4]    #op=[6, 8, 10, 12]
l2=[5,6,7,8]

In [ ]:
[(x+y) for x in l1 for y in l2]

[6, 7, 8, 9, 7, 8, 9, 10, 8, 9, 10, 11, 9, 10, 11, 12]

In [ ]:
[(x+y) for x,y in zip(l1,l2)]

[6, 8, 10, 12]

In [ ]:
l=[1, 2, 3, 4, 5, 6, 7, 8, 9]#original list

In [ ]:
 #output[1, 2] [1, 3] [1, 4] [1, 5] .... [7, 8] [7, 9] [8, 9]

In [ ]:
[[x,y] for x in l for y in l if x<y ]

[[1, 2],
 [1, 3],
 [1, 4],
 [1, 5],
 [1, 6],
 [1, 7],
 [1, 8],
 [1, 9],
 [2, 3],
 [2, 4],
 [2, 5],
 [2, 6],
 [2, 7],
 [2, 8],
 [2, 9],
 [3, 4],
 [3, 5],
 [3, 6],
 [3, 7],
 [3, 8],
 [3, 9],
 [4, 5],
 [4, 6],
 [4, 7],
 [4, 8],
 [4, 9],
 [5, 6],
 [5, 7],
 [5, 8],
 [5, 9],
 [6, 7],
 [6, 8],
 [6, 9],
 [7, 8],
 [7, 9],
 [8, 9]]

Write a Python program to add three given lists using Python map and lambda

In [ ]:
l1=[1,2,3]
l2=[4,5,6]
l3=[3,4,2]
z=zip(l1,l2,l3)
list(map((lambda x:sum(x)),z))

[8, 11, 11]

Write a Python program to create a list containing the power of said number in bases raised to the corresponding number in the index using Python map.
l=[10,20,30,40,50]

In [ ]:
 l=[10,20,30,40,50]

In [ ]:
list(map(lambda x:x*x, l))

[100, 400, 900, 1600, 2500]

In [ ]:
[10,400,27000,]

In [ ]:
l=[10,20,30,40,50]
m = list(map(lambda x: x**(x/10) , l))
m

[10.0, 400.0, 27000.0, 2560000.0, 312500000.0]

In [ ]:
l=[10,20,30,40,50]
index=[1,2,3,4,5]
list(map(pow,l,index))

[10, 400, 27000, 2560000, 312500000]

Write a Python program to convert a given list of strings into list of lists using map function.

In [ ]:
l=['apple','red','green']

In [ ]:
list(map((lambda x:list(x)),l))

[['a', 'p', 'p', 'l', 'e'],
 ['o', 'r', 'a', 'n', 'g', 'e'],
 ['b', 'a', 'n', 'a', 'n', 'a']]

In [ ]:
[['a', 'p', 'p', 'l', 'e'], ['r', 'e', 'd'], ['g', 'r', 'e', 'e', 'n']]

In [ ]:
list(map((lambda x:list(x)),l))

In [ ]:
myTuple = ("John", "Peter", "Vicky")

x = " ".join(myTuple)

print(x)

John Peter Vicky

In [ ]:
myDict = {"name": "John", "country": "Norway"}
mySeparator = "*"

x = mySeparator.join(myDict)

print(x)

name*country

Write a Python program to find the maximum and minimum values in a given list of tuples. Original list with tuples: [('V', 60), ('VI', 70), ('VII', 75), ('VIII', 72), ('IX', 78), ('X', 70)] Maximum and minimum values of the said list of tuples: (78, 60)

In [ ]:
list_1 = ['red' , 'orange', 'blue', 'green', 'black', 'white'] 
list_1.sort()
print(list_1)

['black', 'blue', 'green', 'orange', 'red', 'white']

In [ ]:
l=[1,2,4,2]
l.sort()
l

[1, 2, 2, 4]

In [ ]:
l1=[2,4,1,3]
l2=sorted(l1)
print(l2)
print(l1)

[1, 2, 3, 4]
[2, 4, 1, 3]

In [ ]:
sort & sorted

Write a Python program to find the maximum and minimum values in a given list of tuples. Original list with tuples: [('V', 60), ('VI', 70), ('VII', 75), ('VIII', 72), ('IX', 78), ('X', 70)] Maximum and minimum values of the said list of tuples: (78, 60)

In [ ]:
l= [('V', 60), ('VI', 70), ('VII', 75), ('VIII', 72), ('IX', 78), ('X', 70)]

In [ ]:
output: (78, 60)

In [ ]:
(max(l,key=lambda x:x[1]))

('IX', 78)

In [ ]:
(max(l,key=lambda x:x[1])[1])

78

In [ ]:
(min(l,key=lambda x:x[1])[1])

60

In [ ]:
(max(l,key=lambda x:x[1])[1],min(l,key=lambda x:x[1])[1])

(78, 60)

Write a Python program to get a list, sorted in increasing order by the last element in each tuple from a given list of non-empty tuples. Sample List : [(2, 5), (1, 2), (4, 4), (2, 3), (2, 1)] Expected Result : [(2, 1), (1, 2), (2, 3), (4, 4), (2, 5)

In [ ]:
l= [(2, 5), (1, 2), (4, 4), (2, 3), (2, 1)] 
sorted(l)   # sorted list as per first element of tuples

[(1, 2), (2, 1), (2, 3), (2, 5), (4, 4)]

In [ ]:
l= [(2, 5), (1, 2), (4, 4), (2, 3), (2, 1)] 
sorted(l,key=lambda x:x[1])    # sorted list as per second element of tuples
sorted(l)
sorted(l,key=lambda x:x[1])

[(2, 1), (1, 2), (2, 3), (4, 4), (2, 5)]

Write a Python program to move all zero digits to end of a given list of numbers. Expected output: Original list: [3, 4, 0, 0, 0, 6, 2, 0, 6, 7, 6, 0, 0, 0, 9, 10, 7, 4, 4, 5, 3, 0, 0, 2, 9, 7, 1] Move all zero digits to end of the said list of numbers: [3, 4, 6, 2, 6, 7, 6, 9, 10, 7, 4, 4, 5, 3, 2, 9, 7, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]

In [ ]:
l=[3, 4, 0, 0, 0, 6, 2, 0, 6, 7, 6, 0, 0, 0, 9, 10, 7, 4, 4, 5, 3, 0, 0, 2, 9, 7, 1]

In [ ]:
print(sorted(l,key=lambda x:not x))

[3, 4, 6, 2, 6, 7, 6, 9, 10, 7, 4, 4, 5, 3, 2, 9, 7, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]

In [ ]:
l=[1,2,3,0]

Write a Python program to create a lambda function that adds 15 to a given number passed in as an argument, also create a lambda function that multiplies argument x with argument y and print the result. Sample Output: 25 48

In [ ]:
res=lambda x:x+15
res(10)

25

In [ ]:
res=lambda x,y:x*y
res(12,4)

48

Write a Python program to sort a list of tuples using Lambda. Original list of tuples: [('English', 88), ('Science', 90), ('Maths', 97), ('Social sciences', 82)] Sorting the List of Tuples: [('Social sciences', 82), ('English', 88), ('Science', 90), ('Maths', 97)]

In [ ]:
l1= [('English', 88), ('Science', 90), ('Maths', 97), ('Social sciences', 82)]

In [ ]:
o/p= [('Social sciences', 82), ('English', 88), ('Science', 90), ('Maths', 97)]

In [ ]:
l=[('English', 88), ('Science', 90), ('Maths', 97), ('Social sciences', 82)]
l1=sorted(l,key=lambda x:x[1])
l1

[('Social sciences', 82), ('English', 88), ('Science', 90), ('Maths', 97)]

4.Write a Python program to construct the following pattern, using a nested
for loop.
*
* *
* * *
* * * *
* * * * *
* * * *
* * *
* *
*

In [ ]:
4.Write a Python program to construct the following pattern, using a nested
for loop.
*
* *
* * *
* * * *
* * * * *
* * * *
* * *
* *
*

In [ ]:
for i in range(1,6):    i=1
    print('*'*i)         *
                    i=2
                        **
                        i=3
                        ***
                        i=4
                        ****
                        i=5
                        *****
for i in range(4,0,-1):
    print('*'*i)

IndentationError: unexpected indent (<ipython-input-86-c156b8fa9db8>, line 2)

In [ ]:
for i in range(1,6):    
    print('*'*i)
for i in range(4,0,-1):
    print('*'*i)

*
**
***
****
*****
****
***
**
*

In [ ]:
ipl=[{"name":"Virat","Team":"RCB","runs":1000},
{"name":"MS","Team":"CSK","runs":1},
{"name":"ABD","Team":"Punjab","runs":90},
{"name":"Hardik","Team":"GT","runs":100}]

In [ ]:
l=sorted(ipl,key=lambda x:x['runs'])

In [ ]:
l

[{'name': 'MS', 'Team': 'CSK', 'runs': 1},
 {'name': 'ABD', 'Team': 'Punjab', 'runs': 90},
 {'name': 'Hardik', 'Team': 'GT', 'runs': 100},
 {'name': 'Virat', 'Team': 'RCB', 'runs': 1000}]

In [ ]:
l=sorted(ipl,key=lambda x:x['runs'],reverse=True)

In [ ]:
l

[{'name': 'Virat', 'Team': 'RCB', 'runs': 1000},
 {'name': 'Hardik', 'Team': 'GT', 'runs': 100},
 {'name': 'ABD', 'Team': 'Punjab', 'runs': 90},
 {'name': 'MS', 'Team': 'CSK', 'runs': 1}]

In [ ]:
l1=sorted(ipl,key=lambda x:x['name'])

In [ ]:
l1

[{'name': 'ABD', 'Team': 'Punjab', 'runs': 90},
 {'name': 'Hardik', 'Team': 'GT', 'runs': 100},
 {'name': 'MS', 'Team': 'CSK', 'runs': 1},
 {'name': 'Virat', 'Team': 'RCB', 'runs': 1000}]

In [ ]:
name=["Virat KHOLI","MS DHONI","RAVICHANDRAN ASHWIN"]

In [ ]:
name.sort(key=lambda x:x.split(" ")[0])

In [ ]:
sorted(name,key=lambda x:x.split(" ")[0])

['MS DHONI', 'RAVICHANDRAN ASHWIN', 'Virat KHOLI']

In [ ]:
sorted(name,key=lambda x:x.split(" ")[1])

['RAVICHANDRAN ASHWIN', 'MS DHONI', 'Virat KHOLI']

In [ ]:
sorted(name,key=lambda x:len(x.split(" ")[0]))

['MS DHONI', 'Virat KHOLI', 'RAVICHANDRAN ASHWIN']

In [ ]:
sorted(name,key=lambda x:len(x.split(" ")[0]),reverse=True)

['RAVICHANDRAN ASHWIN', 'Virat KHOLI', 'MS DHONI']

In [ ]:
my_list=[1,2,3,4,5,6,7,8,9,10]

In [ ]:
filter(lambda x:x%2==0,my_list)

In [ ]:
list(filter(lambda x:x%2==0,my_list))

[2, 4, 6, 8, 10]

In [ ]:
d={1:2,3:4,5:6,7:8}

In [ ]:
filter(lambda x:x>5,d)

In [ ]:
list(filter(lambda x:x>5,d))

[7]

In [ ]:
data=[10,20,30,40,50,60,70,80,90,100]

In [ ]:
avg=sum(data)/len(data)
avg

55.0

In [ ]:
list(filter(lambda x:x<avg,data))

[10, 20, 30, 40, 50]

Write a Python program to convert a given list of tuples to a list of strings using map function

In [ ]:
l = [('red', 'pink'), ('white', 'black'), ('orange', 'green')]

In [ ]:
['redpink', 'whiteblack', 'orangegreen']   output

In [ ]:
list(map(''.join,l))

['redpink', 'whiteblack', 'orangegreen']

Map, filter, reduce: iterables(list, tuples, dict)   and to work on iterables we need lambda fuction

In [ ]:
from functools import reduce  #iterables:

nums = [1, 2, 3, 4]
ans = reduce(lambda x, y: x + y, nums)
print(ans)

10

In [ ]:
l=(1,4,3,5)
reduce(lambda x,y:x*y,l)

60

In [ ]:
import pandas as pd

In [ ]:
data = pd.DataFrame({'Brand' : ['Maruti','Maruti', 'Hyundai', 'Tata',
                                'Mahindra', 'Maruti', 'Hyundai',
                                'Renault', 'Tata', 'Maruti'],
                     'Year' : [2012,2012, 2014, 2011, 2015, 2012, 
                               2016, 2014, 2018, 2019],
                     'Kms Driven' : [50000,50000, 30000, 60000, 
                                     25000, 10000, 46000, 
                                     31000, 15000, 12000],
                     'City' : ['Gurgaon','Gurgaon', 'Delhi', 'Mumbai', 
                               'Delhi', 'Mumbai', 'Delhi', 
                               'Mumbai','Chennai',  'Ghaziabad'],
                     'Mileage' :  [28,28, 27, 25, 26, 28, 
                                   29, 24, 21, 24]})

In [ ]:
data

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1    Maruti  2012       50000    Gurgaon       28
2   Hyundai  2014       30000      Delhi       27
3      Tata  2011       60000     Mumbai       25
4  Mahindra  2015       25000      Delhi       26
5    Maruti  2012       10000     Mumbai       28
6   Hyundai  2016       46000      Delhi       29
7   Renault  2014       31000     Mumbai       24
8      Tata  2018       15000    Chennai       21
9    Maruti  2019       12000  Ghaziabad       24

In [ ]:
data.nsmallest(2,'Mileage')

     Brand  Year  Kms Driven     City  Mileage
8     Tata  2018       15000  Chennai       21
7  Renault  2014       31000   Mumbai       24

In [ ]:
data.nsmallest(2,'Mileage')[['City']]

      City
8  Chennai
7   Mumbai

In [ ]:
data.nsmallest(2,'Mileage')[['Brand','Year']]

     Brand  Year
8     Tata  2018
7  Renault  2014

In [ ]:
d=data.drop('Brand',axis=1)

In [ ]:
d

   Year  Kms Driven       City  Mileage
0  2012       50000    Gurgaon       28
1  2012       50000    Gurgaon       28
2  2014       30000      Delhi       27
3  2011       60000     Mumbai       25
4  2015       25000      Delhi       26
5  2012       10000     Mumbai       28
6  2016       46000      Delhi       29
7  2014       31000     Mumbai       24
8  2018       15000    Chennai       21
9  2019       12000  Ghaziabad       24

In [ ]:
data.pop('Brand')

0      Maruti
1      Maruti
2     Hyundai
3        Tata
4    Mahindra
5      Maruti
6     Hyundai
7     Renault
8        Tata
9      Maruti
Name: Brand, dtype: object

In [ ]:
data

   Year  Kms Driven       City  Mileage
0  2012       50000    Gurgaon       28
1  2012       50000    Gurgaon       28
2  2014       30000      Delhi       27
3  2011       60000     Mumbai       25
4  2015       25000      Delhi       26
5  2012       10000     Mumbai       28
6  2016       46000      Delhi       29
7  2014       31000     Mumbai       24
8  2018       15000    Chennai       21
9  2019       12000  Ghaziabad       24

In [ ]:
del data['City']

In [ ]:
data

   Year  Kms Driven  Mileage
0  2012       50000       28
1  2012       50000       28
2  2014       30000       27
3  2011       60000       25
4  2015       25000       26
5  2012       10000       28
6  2016       46000       29
7  2014       31000       24
8  2018       15000       21
9  2019       12000       24

In [ ]:
data.drop([2,4])  #2,4 is column 0 ie. index

   Year  Kms Driven  Mileage
0  2012       50000       28
1  2012       50000       28
3  2011       60000       25
5  2012       10000       28
6  2016       46000       29
7  2014       31000       24
8  2018       15000       21
9  2019       12000       24

In [ ]:
data.drop(data.index[2:3])     #drop rows from one row to other

   Year  Kms Driven  Mileage
0  2012       50000       28
1  2012       50000       28
3  2011       60000       25
4  2015       25000       26
5  2012       10000       28
6  2016       46000       29
7  2014       31000       24
8  2018       15000       21
9  2019       12000       24

In [ ]:
data.set_index("Year")

      Kms Driven  Mileage
Year
2012       50000       28
2012       50000       28
2014       30000       27
2011       60000       25
2015       25000       26
2012       10000       28
2016       46000       29
2014       31000       24
2018       15000       21
2019       12000       24

In [ ]:
l=[0,1,2,3,4,5,6,7,8]
data.reindex(l)

   Year  Kms Driven  Mileage
0  2012       50000       28
1  2012       50000       28
2  2014       30000       27
3  2011       60000       25
4  2015       25000       26
5  2012       10000       28
6  2016       46000       29
7  2014       31000       24
8  2018       15000       21

In [ ]:
data.rename(columns={"Mileage":"M"})

   Year  Kms Driven   M
0  2012       50000  28
1  2012       50000  28
2  2014       30000  27
3  2011       60000  25
4  2015       25000  26
5  2012       10000  28
6  2016       46000  29
7  2014       31000  24
8  2018       15000  21
9  2019       12000  24

In [ ]:
df1=pd.read_csv(r"C:\Users\Chetna\Desktop\Python velocity\weather_data.csv")

In [ ]:
df1

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [ ]:
df1.drop("temperature",axis=1)   # directly delete column since it has missing data

         day  windspeed   event
0   1/1/2017        6.0    Rain
1   1/4/2017        9.0   Sunny
2   1/5/2017        NaN    Snow
3   1/6/2017        7.0     NaN
4   1/7/2017        NaN    Rain
5   1/8/2017        NaN   Sunny
6   1/9/2017        NaN     NaN
7  1/10/2017        8.0  Cloudy
8  1/11/2017       12.0   Sunny

In [ ]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          9 non-null      object
 1   temperature  5 non-null      float64
 2   windspeed    5 non-null      float64
 3   event        7 non-null      object
dtypes: float64(2), object(2)
memory usage: 416.0+ bytes

In [ ]:
#drop rows with missing values
df1.dropna(how="any")

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [ ]:
df1.dropna(how="all")

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [ ]:
df1.fillna(0)

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          0.0        9.0   Sunny
2   1/5/2017         28.0        0.0    Snow
3   1/6/2017          0.0        7.0       0
4   1/7/2017         32.0        0.0    Rain
5   1/8/2017          0.0        0.0   Sunny
6   1/9/2017          0.0        0.0       0
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [ ]:
df1.fillna("nop")

         day temperature windspeed   event
0   1/1/2017        32.0       6.0    Rain
1   1/4/2017         nop       9.0   Sunny
2   1/5/2017        28.0       nop    Snow
3   1/6/2017         nop       7.0     nop
4   1/7/2017        32.0       nop    Rain
5   1/8/2017         nop       nop   Sunny
6   1/9/2017         nop       nop     nop
7  1/10/2017        34.0       8.0  Cloudy
8  1/11/2017        40.0      12.0   Sunny

In [ ]:
df1.fillna(df1['temperature'].mean())

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017         33.2        9.0   Sunny
2   1/5/2017         28.0       33.2    Snow
3   1/6/2017         33.2        7.0    33.2
4   1/7/2017         32.0       33.2    Rain
5   1/8/2017         33.2       33.2   Sunny
6   1/9/2017         33.2       33.2    33.2
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [ ]:
df1['temperature'].fillna(df1['temperature'].mean())

0    32.0
1    33.2
2    28.0
3    33.2
4    32.0
5    33.2
6    33.2
7    34.0
8    40.0
Name: temperature, dtype: float64

In [ ]:
df1.fillna({'temperature':0,'windspeed':1,'event':'pop'})

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          0.0        9.0   Sunny
2   1/5/2017         28.0        1.0    Snow
3   1/6/2017          0.0        7.0     pop
4   1/7/2017         32.0        1.0    Rain
5   1/8/2017          0.0        1.0   Sunny
6   1/9/2017          0.0        1.0     pop
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [ ]:
df1.fillna(method="bfill")

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017         28.0        9.0   Sunny
2   1/5/2017         28.0        7.0    Snow
3   1/6/2017         32.0        7.0    Rain
4   1/7/2017         32.0        8.0    Rain
5   1/8/2017         34.0        8.0   Sunny
6   1/9/2017         34.0        8.0  Cloudy
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [ ]:
df1

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [ ]:
df1.fillna(method="ffill",limit=1)

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017         32.0        9.0   Sunny
2   1/5/2017         28.0        9.0    Snow
3   1/6/2017         28.0        7.0    Snow
4   1/7/2017         32.0        7.0    Rain
5   1/8/2017         32.0        NaN   Sunny
6   1/9/2017          NaN        NaN   Sunny
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [ ]:
df = pd.DataFrame({
    'score': ['exceptional','average', 'good', 'poor', 'average', 'exceptional'],
    'student': ['rob', 'maya', 'parthiv', 'tom', 'julian', 'erica']
})
df

         score  student
0  exceptional      rob
1      average     maya
2         good  parthiv
3         poor      tom
4      average   julian
5  exceptional    erica

In [ ]:
df1=df.replace(["poor","average","good","exceptional"],[4,3,2,1])
df1

   score  student
0      1      rob
1      3     maya
2      2  parthiv
3      4      tom
4      3   julian
5      1    erica